<?php

declare(strict_types=1);

return [
    'number' => 12322,
    'date' => '01.09.2019',
    'request' => 768876,
    'requisites' => [
        'customer' => [
            'name' => 'ООО «Сила»',
            'inn' => 777777777,
            'kpp' => 777777777,
            'postcode' => 105111,
            'addr' => 'г. Москва, Рублевское шоссе,  д.32,к.2, оф.777'
        ],
        'agent' => [
            'name' => 'ООО «Джи Системс»',
            'inn' => 777777777,
            'kpp' => 777777777,
            'postcode' => 143355,
            'addr' => 'Московская область, Балашихинский район, мкр. Янтарный, ул. Кольцевая, д.10, к.3, оф.2'
        ],
        'executer' => [
            'name' => 'ООО «Джи Системс»',
            'inn' => 777777777,
            'kpp' => 777777777,
            'postcode' => 105111,
            'addr' => 'Московская область, Балашихинский район, мкр. Янтарный, ул. Кольцевая, д.10, к.3, оф.2'
        ]
    ],
    'loading' => [
        'shipper' => [
            'name' => 'ООО «Джи Системс»',
            'inn' => 52000000,
            'kpp' => 52000000,
            'postcode' => 111111,
            'addr' => 'Петропавловск — Камчатский, ул. Кутузова, д.21, стр.2, оф.1',
            'contact_person' => 'Степанов Степан Степанович',
            'phone' => '+7 999 888 88 88'
        ],
        'place' => [
            'name' => 'ООО «Прогресс М»',
            'inn' => 777777777,
            'kpp' => 777777777,
            'postcode' => 105111,
            'addr' => 'Московская область, Балашихинский район, мкр. Янтарный, ул. Кольцевая, д.10, к.3, оф.2',
            'contact_person' => 'Петров Петр Петрович',
            'phone' => '+7 999 888 88 88'
        ]
    ],
    'unloading' => [
        [
            'consignee' => [
                'name' => 'ООО «Тополь Ж1111»',
                'inn' => 52000001,
                'kpp' => 52000000,
                'postcode' => 212883,
                'addr' => 'Новый Уренгой, ул. Красная Плесень, д.66, оф.2   ',
                'contact_person' => 'Степанов Степан Степанович',
                'phone' => '+7 2331 444 555'
            ],
            'place' => [
                'name' => 'ООО «Прогресс М»',
                'inn' => 777777777,
                'kpp' => 777777777,
                'postcode' => 105111,
                'addr' => 'Петропавловск — Камчатский, ул. Кутузова, д.21, стр.2, оф.1',
                'contact_person' => 'Петров Петр Петрович',
                'phone' => '+7 999 888 88 88'
            ]
        ],
        [
            'consignee' => [
                'name' => 'ООО «Тополь Ж22222»',
                'inn' => 52000002,
                'kpp' => 52000000,
                'postcode' => 212883,
                'addr' => 'Новый Уренгой, ул. Красная Плесень, д.66, оф.2   ',
                'contact_person' => 'Степанов Степан Степанович',
                'phone' => '+7 2331 444 555'
            ],
            'place' => [
                'name' => 'ООО «Прогресс М»',
                'inn' => 777777777,
                'kpp' => 777777777,
                'postcode' => 105111,
                'addr' => 'Петропавловск — Камчатский, ул. Кутузова, д.21, стр.2, оф.1',
                'contact_person' => 'Петров Петр Петрович',
                'phone' => '+7 999 888 88 88'
            ]
        ],
        [
            'consignee' => [
                'name' => 'ООО «Тополь Ж3333»',
                'inn' => 52000003,
                'kpp' => 52000000,
                'postcode' => 212883,
                'addr' => 'Новый Уренгой, ул. Красная Плесень, д.66, оф.2   ',
                'contact_person' => 'Степанов Степан Степанович',
                'phone' => '+7 2331 444 555'
            ],
            'place' => [
                'name' => 'ООО «Прогресс М»',
                'inn' => 777777777,
                'kpp' => 777777777,
                'postcode' => 105111,
                'addr' => 'Петропавловск — Камчатский, ул. Кутузова, д.21, стр.2, оф.1',
                'contact_person' => 'Петров Петр Петрович',
                'phone' => '+7 999 888 88 88'
            ]
        ]
    ]
];
